Repository: robots/STM32
Catalog: lib/CanFestival-3/objdictgen/i18n/objdictgen_*.po
Languages: fr_fr

source: An error happens. Click on OK for saving an error report. Please be kind enough to send this file to: edouard.tisserant@gmail.com Error:
fr_fr: Une erreur est apparue. Appuyez sur 'Valider' pour enregistrer un rapport d'erreur. Envoyez ce fichier à l'adresse : edouard.tisserant@gmail.com Erreur :

source: Domain variable not initialized index : 0x%04X subindex : 0x00
fr_fr: La variable de type Domain n'est pas initialisée indice : 0x%04X sous-indice : 0x00

source: Usage of networkedit.py :
fr_fr: Utilisation de networkedit.py :

source: Usage of objdictedit.py :
fr_fr: Utilisation de objdictedit.py :

source: Usage of objdictgen.py :
fr_fr: Utilisation de objdictgen.py :

source: and %s
fr_fr: et %s

source: must be integer!
fr_fr: doit être un entier !

source: must be integers!
fr_fr: doivent être des entiers !

source: possibly defined %d times
fr_fr: peut être défini %d fois

source: !!! %s isn't a valid type for CanFestival.
fr_fr: !!! %s n'est pas un type valide pour CanFestival.

source: !!! Datatype with value "0x%4.4X" isn't defined in CanFestival.
fr_fr: !!! Le type de donnée dont la valeur est "0x%4.4X" n'est pas défini dans CanFestival.

source: "%s" EDS file is not available
fr_fr: Le fichier EDS "%s" n'est pas disponible

source: "%s" folder doesn't exist
fr_fr: Le répertoire "%s" n'existe pas

source: "%s" is not a valid CPJ line
fr_fr: "%s" n'est pas une ligne de fichier CPJ valide

source: "%s" is not a valid EDS line
fr_fr: "%s" n'est pas une ligne de fichier EDS valide

source: "%s" is not a valid file!
fr_fr: "%s" n'est pas un fichier valide !

source: "%s" is not a valid folder!
fr_fr: "%s" n'est pas un répertoire valide !

source: "%s" is not a valid formula for attribute "%s" of section "[%s]"
fr_fr: "%s" n'est pas une formule valide pour l'attribut "%s" de la section "[%s]"

source: "%s" is not a valid value for attribute "%s" of section "[%s]"
fr_fr: "%s" n'est pas une valeur valide pour l'attribut "%s" de la section "[%s]"

source: "%s" is not a valid value!
fr_fr: "%s" n'est pas une valeur valide !

source: "Node%dPresent" keyname in "[%s]" section is missing
fr_fr: "Node%dPresent" mot clé est absent de la section "[%s]"

source: "Nodes" keyname in "[%s]" section is missing
fr_fr: "Nodes" mot clé est absent de la section "[%s]"

source: "Nodes" value not corresponding to number of nodes defined
fr_fr: La valeur de "Nodes" ne correspond pas au nombre de noeuds définis

source: "[%s]" section is defined two times
fr_fr: La section "[%s]" est définie deux fois

source: %s Would you like to replace it ?
fr_fr: %s Voulez-vous le remplacer ?

source: %s Profile
fr_fr: Profil %s

source: %s is not a valid file!
fr_fr: %s n'est pas un fichier valide !

source: %s is not a valid folder!
fr_fr: %s n'est pas un répertoir valide !

source: %s: %s entry of struct %s%s.
fr_fr: %s : entrée %s de type %s%s.

source: A Node with this ID already exist in the network!
fr_fr: Un noeud avec cet ID existe déjà dans le réseau !

source: A type must be selected!
fr_fr: Un type doit être sélectionné !

source: About
fr_fr: A propos

source: About CAN Festival
fr_fr: A propos de CanFestival

source: Add
fr_fr: Ajouter

source: Add Map Variable
fr_fr: Ajouter une variable mappable

source: Add Slave Node
fr_fr: Ajouter un noeud esclave

source: Add User Type
fr_fr: Ajouter un type utilisateur

source: Add a slave to nodelist
fr_fr: Ajouter un esclave à la liste des noeuds

source: Add subindexes
fr_fr: Ajouter des sous-indices

source: Add to DCF
fr_fr: Ajouter à la DCF

source: All done
fr_fr: Terminé

source: An integer is required!
fr_fr: Un entier est nécessaire !

source: Array or Record entry 0x%4.4X must have a "SubNumber" attribute
fr_fr: L'entrée de type Array ou Record à l'indice 0x%4.4X doit avoir un attribut "SubNumber" attribute

source: Attribute "%s" is
fr_fr: L'attribut "%s" est

source: Attributes %s are
fr_fr: Les attributs %s sont

source: Build Dictionary CTRL+B
fr_fr: Généré le dictionnaire CTRL+B

source: Build Master Dictionary
fr_fr: Généré le dictionnaire du maître

source: CAN Festival Docs F2
fr_fr: Documentation de CAN Festival F2

source: CANFestival C files (*.c)|*.c|All files|*.*
fr_fr: Fichiers C de CANFestival (*.c)|*.c|Tous les fichiers|*.*

source: Can't find node
fr_fr: Impossible de trouver le noeud

source: Check if Acrobat Reader is correctly installed on your computer
fr_fr: Vérifiez si Acrobat Reader est correctement installé sur votre ordinateur

source: Check if xpdf is correctly installed on your computer
fr_fr: Vérifiez si xpdf est correctement installé sur votre ordinateur

source: Choose a file
fr_fr: Choisissez un fichier

source: Choose a project
fr_fr: Choisissez un projet

source: Choose a slave to remove
fr_fr: Choisissez un esclave à supprimer

source: Choose an EDS file
fr_fr: Choisissez un fichier EDS

source: Close CTRL+W
fr_fr: Fermer CTRL+W

source: Close Application
fr_fr: Fermer l'application

source: Close File
fr_fr: Fermer le fichier

source: Close Project
fr_fr: Fermer le projet

source: Couldn't find DS-302 in 'config' folder!
fr_fr: Impossible de trouver la DS-302 dans le répertoire 'config' !

source: Create a new Node
fr_fr: Créer un nouveau noeud

source: Current Profile Indexes:
fr_fr: Indices actuels du profil :

source: DS-301 Profile
fr_fr: Profil DS-301

source: DS-301 Standard F1
fr_fr: Standard DS-301 F1

source: DS-302 Profile
fr_fr: Profil DS-302

source: Default String Size:
fr_fr: Taille des chaînes par défaut :

source: Default value
fr_fr: Valeur par défaut

source: Delete
fr_fr: Supprimer

source: Delete subindexes
fr_fr: Supprimer les sous-indices

source: Domain entry 0x%4.4X DataType must be 0xF(DOMAIN) if defined
fr_fr: Le mot clé DataTytpe de l'entrée 0x%4.4X de type Domain doit avoir la valeur 0xF(DOMAIN) s'il est défini

source: EDS File
fr_fr: Fichier EDS

source: EDS File:
fr_fr: Fichier EDS :

source: EDS file already imported
fr_fr: Le fichier EDS a déjà été importé

source: EDS files (*.eds)|*.eds|All files|*.*
fr_fr: Fichiers EDS (*.eds)|*.eds|Tous les fichiers|*.*

source: ERROR
fr_fr: ERREUR

source: Edit
fr_fr: Edition

source: Edit %s Profile
fr_fr: Editer le profil %s

source: Edit Communication Profile
fr_fr: Editer le profile de communication

source: Edit DCF Entry Values
fr_fr: Editer les valeurs de l'entrée de la DCF

source: Edit DS-301 Profile
fr_fr: Editer le profil DS-301

source: Edit DS-302 Profile
fr_fr: Editer le profil DS-302

source: Emergency support
fr_fr: Support pour l'Emergency

source: Entry Values:
fr_fr: Valeurs de l'entrée :

source: Error
fr_fr: Erreur

source: Error on section "[%s]": %s incompatible with DataType
fr_fr: Erreur dans la "[%s]" : %s est incompatible avec le type de donnée

source: Error on section "[%s]": %s required for a %s entry
fr_fr: Erreur dans la "[%s]" : %s obligatoire pour une entrée %s

source: Error on section "[%s]": %s unsupported for a %s entry
fr_fr: Erreur dans la "[%s]" : %s optionnel pour une entrée %s

source: Exit
fr_fr: Quitter

source: Export successful
fr_fr: Exportation réussie

source: Export to EDS file
fr_fr: Exporter au format EDS

source: Fail to save Master Node
fr_fr: L'enregistrement du noeud maître a échoué

source: Fail to save node list
fr_fr: L'enregistrement de la liste des noeuds a échoué

source: False
fr_fr: Faux

source: File
fr_fr: Fichier

source: Form isn't complete. %s must be filled!
fr_fr: Le formulaire n'est pas complet. %s doit être rempli !

source: Form isn't valid. %s
fr_fr: Le formulaire est incomplet. %s

source: Generate SYNC
fr_fr: Générer la synchro

source: Give a new name for index 0x%04X
fr_fr: Donnez un nouveau nom à l'indice 0x%04X

source: Have Callbacks
fr_fr: Utilise des Callbacks

source: Help
fr_fr: Aide

source: Import EDS
fr_fr: Importer un EDS

source: Import EDS file
fr_fr: Importer un fichier EDS

source: Import successful
fr_fr: L'importation a réussi

source: Index
fr_fr: Indice

source: Index 0x%04X already defined!
fr_fr: L'indice 0x%04X est déjà défini !

source: Index 0x%04X isn't a valid index for Map Variable!
fr_fr: L'indice 0x%04X n'est pas valide pour un variable mappable !

source: Index:
fr_fr: Indice :

source: Index: 0x%04X
fr_fr: Indice: 0x%04X

source: Invalid value "%s" for keyname "%s" of section "[%s]"
fr_fr: Valeur "%s" invalide pour le mot-clé "%s" dans la section "[%s]"

source: Keyname "%s" not recognised for section "[%s]"
fr_fr: Le mot-clé "%s" n'est pas reconnu dans la section "[%s]"

source: Length
fr_fr: Taille

source: Length:
fr_fr: Taille:

source: Mandatory
fr_fr: Obligatoire

source: Map Variable
fr_fr: Variable mappable

source: Modify
fr_fr: Modifier

source: Name:
fr_fr: Nom :

source: Network
fr_fr: Réseau

source: Network Management:
fr_fr: Gestion de réseau :

source: New CTRL+N
fr_fr: Nouveau CTRL+N

source: No
fr_fr: Non

source: No map variable index left!
fr_fr: Il n'y a plus d'indice disponible pour une varaible mappable !

source: Node 0x%2.2X doesn't exist
fr_fr: Le noeud 0x%2.2X n'existe pas

source: Node ID must be integer!
fr_fr: L'ID du noeud doit être un entier !

source: Node ID:
fr_fr: ID du noeud :

source: Node infos
fr_fr: Propriétés du noeud

source: Node name can't be undefined or start with a digit and must be composed of alphanumerical characters or underscore!
fr_fr: Le nom d'un noeud ne peut être indéfini ou commencer par un chiffre et ne doit comporter que des caractères alphanumériaques ou des underscores !

source: Node with "0x%2.2X" ID doesn't exist
fr_fr: Le noeud d'ID "0x%2.2X" n'existe pas

source: None
fr_fr: Aucun

source: Number
fr_fr: Nombre

source: Number of subindexes to add:
fr_fr: Nombre de sous-indices à ajouter :

source: Number of subindexes to delete:
fr_fr: Nombre de sous-indices à supprimer :

source: Number:
fr_fr: Nombre :

source: OD Profile files (*.prf)|*.prf|All files|*.*
fr_fr: Fichiers de profil d'OD (*.prf)|*.prf|Tous les fichiers|*.*

source: OD files (*.od)|*.od|All files|*.*
fr_fr: Fichiers d'OD (*.od)|*.od|Tous les fichiers|*.*

source: Open CTRL+O
fr_fr: Ouvrir CTRL+O

source: Optional
fr_fr: Optionnel

source: Other
fr_fr: Autre

source: Other Profile
fr_fr: Autre profil

source: PDO Receive
fr_fr: PDO Reçu

source: PDO Transmit
fr_fr: PDO transmis

source: Parsing input file
fr_fr: Analyse du fichier d'entrée en cours

source: Please point your browser at: %s
fr_fr: Veuillez afficher l'adresse suivante dans votre navigateur : %s

source: Possible Profile Indexes:
fr_fr: Indice possibles du profil :

source: Problem with DS-302! Syntax Error.
fr_fr: Problème avec la DS-302 ! Erreur de syntaxe.

source: Profile:
fr_fr: Profil :

source: Read Only
fr_fr: Lecture seule

source: Read/Write
fr_fr: Lecture/Ecriture

source: Redo CTRL+Y
fr_fr: Refaire CTRL+Y

source: Refresh CTRL+R
fr_fr: Actualiser CTRL+R

source: Remove Slave Node
fr_fr: Supprimer un noeud esclave

source: Remove slave
fr_fr: Supprimer un esclave

source: Rename
fr_fr: Renommer

source: Rename an index
fr_fr: Renommer un indice

source: SDO Client
fr_fr: Client SDO

source: SDO Server
fr_fr: Serveur SDO

source: Save CTRL+S
fr_fr: Enregistrer CTRL+S

source: Save As... ALT+S
fr_fr: Enregistrer sous... ALT+S

source: Save Configuration
fr_fr: Enregistrer la configuration

source: Section "[%s]" is unrecognized
fr_fr: La section "[%s]" n'est pas reconnue

source: Size
fr_fr: Taille

source: Slave Name
fr_fr: Nom de l'exclave

source: Slave Name:
fr_fr: Nom de l'esclave :

source: Slave Node ID
fr_fr: ID du noeud esclave

source: Slave Node ID must be a value in decimal or hexadecimal!
fr_fr: L'ID du noeud esclave doit être une valeur décimale ou héxadécimale !

source: Slave Node ID must be between 0 and 127!
fr_fr: L'ID du noeud esclave doit être compris entre 0 et 127 !

source: Slave Node ID:
fr_fr: ID du noeud esclave :

source: Store EDS
fr_fr: Stocker l'EDS

source: Subindex
fr_fr: Sous-indice

source: Subindex: 0x%02X
fr_fr: Sous-indice : 0x%02X

source: Syntax Error Bad OD Profile file!
fr_fr: Erreur de syntaxe Fichier de profil d'OD incorrect !

source: There are changes, do you want to save?
fr_fr: Il y a des changements, voulez-vous enregistrer ?

source: Too many User Types have already been defined!
fr_fr: Trop de types utilisateurs ont déjà été définis !

source: True
fr_fr: Vrai

source: Unable to Generate C File %s
fr_fr: Impossible de générer le fichier C %s

source: Unable to generate EDS file %s
fr_fr: Impossible de générer le fichier EDS %s

source: Unable to import EDS file %s
fr_fr: Impossible d'importer le fichier EDS %s

source: Unable to load CPJ file %s
fr_fr: Impossible de charge le fichier CPJ %s

source: Unable to load file "%s"!
fr_fr: Impossible de charger le fichier "%s" !

source: Undefined
fr_fr: Inconnu

source: Undo CTRL+Z
fr_fr: Défaire CTRL+Z

source: Unnamed%d
fr_fr: Sansnom%d

source: User Type
fr_fr: Type utilisateur

source: Value
fr_fr: Valeur

source: Values
fr_fr: Valeurs

source: Write Only
fr_fr: Ecriture seule

source: Writing output file
fr_fr: Ecriture du fichier de sortie en cours

source: Yes
fr_fr: Oui

source: access
fr_fr: accès

source: comment
fr_fr: commentaire

source: file :
fr_fr: fichier :

source: function :
fr_fr: fonction :

source: line :
fr_fr: ligne :

source: master
fr_fr: maître

source: name
fr_fr: nom

source: save
fr_fr: enregistrer

source: slave
fr_fr: esclave

source: subindex
fr_fr: sous-indice

source: value
fr_fr: valeur
